src/Catalogs/РА_КлючиАналитикиУчетаБонуснойПрограммы/РА_КлючиАналитикиУчетаБонуснойПрограммы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РА_КлючиАналитикиУчетаБонуснойПрограммы</name>
  <attributes>
    <name>ОбъектНастройки</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодДействия</name>
    <type>
      <types>CatalogRef.РА_ПериодыДействияБонуса</types>
    </type>
  </attributes>
  <attributes>
    <name>УидБонуснойПрограммы</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/AccumulationRegisters/РА_БонусыПартнерам/РА_БонусыПартнерам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РА_БонусыПартнерам</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВыручки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПроцентПремии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>АналитикаУчетаБонуснойПрограммы</name>
    <type>
      <types>CatalogRef.РА_БонусныеПрограммы</types>
      <types>CatalogRef.РА_КлючиАналитикиУчетаБонуснойПрограммы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипПремии</name>
    <type>
      <types>EnumRef.РА_ТипыПремийПартнерам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Catalogs/РА_КлючиАналитикиУчетаБонуснойПрограммы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ПодобратьКлючАналитикиУчетаБонуснойПрограммы(ОбъектНастройки, ПериодДействия, УидБонуснойПрограммы) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РА_КлючиАналитикиУчетаБонуснойПрограммы.Ссылка КАК КлючАналитикиУчетаБонуснойПрограммы
	|ИЗ
	|	Справочник.РА_КлючиАналитикиУчетаБонуснойПрограммы КАК РА_КлючиАналитикиУчетаБонуснойПрограммы
	|ГДЕ
	|	РА_КлючиАналитикиУчетаБонуснойПрограммы.ОбъектНастройки = &ОбъектНастройки
	|	И РА_КлючиАналитикиУчетаБонуснойПрограммы.ПериодДействия = &ПериодДействия
	|	И РА_КлючиАналитикиУчетаБонуснойПрограммы.УидБонуснойПрограммы = &УидБонуснойПрограммы";
	
	Запрос.УстановитьПараметр("ОбъектНастройки", ОбъектНастройки);
	Запрос.УстановитьПараметр("ПериодДействия", ПериодДействия);
	Запрос.УстановитьПараметр("УидБонуснойПрограммы", УидБонуснойПрограммы);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		Возврат РезультатЗапроса.КлючАналитикиУчетаБонуснойПрограммы;
	Иначе
		НовыйКлюч = Справочники.РА_КлючиАналитикиУчетаБонуснойПрограммы.СоздатьЭлемент();
		НовыйКлюч.ОбъектНастройки = ОбъектНастройки;
		НовыйКлюч.ПериодДействия = ПериодДействия;
		НовыйКлюч.УидБонуснойПрограммы = УидБонуснойПрограммы;
		НовыйКлюч.Записать();
		
		Возврат НовыйКлюч.Ссылка;
	КонецЕсли;	
		
КонецФункции

Функция ПроверитьИспользованиеКлючаАналитикиУчетаБонуснойПрограммы(УидБонуснойПрограммы) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РА_БонусыПартнерам.АналитикаУчетаБонуснойПрограммы КАК АналитикаУчетаБонуснойПрограммы
		|ИЗ
		|	РегистрНакопления.РА_БонусыПартнерам КАК РА_БонусыПартнерам
		|ГДЕ
		|	РА_БонусыПартнерам.АналитикаУчетаБонуснойПрограммы.УидБонуснойПрограммы = &УидБонуснойПрограммы";
	
	Запрос.УстановитьПараметр("УидБонуснойПрограммы", УидБонуснойПрограммы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат Истина;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции	

Функция ПометитьКлючАналитикиУчетаБонуснойПрограммыНаУдаление(УидБонуснойПрограммы) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РА_КлючиАналитикиУчетаБонуснойПрограммы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.РА_КлючиАналитикиУчетаБонуснойПрограммы КАК РА_КлючиАналитикиУчетаБонуснойПрограммы
		|ГДЕ
		|	РА_КлючиАналитикиУчетаБонуснойПрограммы.УидБонуснойПрограммы = &УидБонуснойПрограммы";
	
	Запрос.УстановитьПараметр("УидБонуснойПрограммы", УидБонуснойПрограммы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КлючОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		КлючОбъект.ПометкаУдаления = Истина;
		КлючОбъект.Записать();
	КонецЦикла;
	
КонецФункции	

#КонецЕсли
